In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
#Text and CSV

In [4]:
dframe1 = pd.read_csv('wwd_f1.csv')
dframe1

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [5]:
dframe1 = pd.read_csv('wwd_f1.csv',header = None)
dframe1

    0  1  2  3       4
0   q  r  s  t   apple
1   2  3  4  5    pear
2   a  s  d  f  rabbit
3   5  2  5  7     dog

In [8]:
dframe1 = pd.read_table('wwd_f1.csv',sep=',',header = None)
dframe1

    0  1  2  3       4
0   q  r  s  t   apple
1   2  3  4  5    pear
2   a  s  d  f  rabbit
3   5  2  5  7     dog

In [9]:
pd.read_csv('wwd_f1.csv',header = None,nrows=2)

    0  1  2  3      4
0   q  r  s  t  apple
1   2  3  4  5   pear

In [10]:
dframe1.to_csv('mytest_out.csv')

In [4]:
import sys

In [13]:
dframe1.to_csv(sys.stdout)

,0,1,2,3,4
0, q,r,s,t,apple
1,2,3,4,5,pear
2,a,s,d,f,rabbit
3,5,2,5,7,dog

In [14]:
dframe1.to_csv(sys.stdout,sep='_')

_0_1_2_3_4
0_ q_r_s_t_apple
1_2_3_4_5_pear
2_a_s_d_f_rabbit
3_5_2_5_7_dog

In [15]:
dframe1.to_csv(sys.stdout,columns=[0,1,2])

,0,1,2
0, q,r,s
1,2,3,4
2,a,s,d
3,5,2,5

In [16]:
#Json

In [17]:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [18]:
import json

data = json.loads(json_obj)

In [19]:
data

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]}

In [20]:
json.dumps(data)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [22]:
dframe2 = DataFrame(data['diet'])
dframe2

  zoo_animal   food    fur
0    Gazelle  grass  Brown

In [23]:
# HTML

In [3]:
from pandas import read_html

In [4]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

In [5]:
dframe = pd.io.html.read_html(url)

In [12]:
dframe = dframe[0]

In [14]:
dframe.columns.values

array(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'], dtype=object)

In [1]:
# XLS

In [7]:
xlsfile = pd.ExcelFile('wwd_f2.xlsx')
xlsfile

In [9]:
dframe = pd.io.excel.read_excel(xlsfile)
dframe

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365

In [10]:
dframe = xlsfile.parse('Sheet1')
dframe

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365